tap "elsorino/homebrew-elso"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "zero-sh/tap"

brew "asciiquarium"
brew "autojump"
brew "balena-cli"
brew "calcurse"
brew "clang-format"
brew "coreutils"
brew "coreutils"
brew "docker"
brew "docker-credential-helper"
brew "docker-machine" # , restart_service: true  # required for docker. do not start here as it may tamper with virtualbox updating
brew "dockutil"
brew "enscript"
brew "figlet"
brew "gcc"
brew "geckodriver"
brew "ghostscript" # for ps2pdf
brew "gnu-getopt"
brew "gnu-typist"
brew "gotop"
brew "gpg"
brew "htop"
brew "imagemagick"
brew "jq"
brew "koekeishiya/formulae/skhd", restart_service: true
brew "koekeishiya/formulae/yabai", restart_service: true
brew "lf"
brew "libusb"
brew "llvm"
brew "mas"
brew "neofetch"
brew "neovim"
brew "openvpn"
brew "pandoc"
brew "parallel" # experimenting with piping multiple arguments
brew "pass"
brew "pipes-sh"
brew "platformio"
brew "poppler" # for pdftotext and pdftoppm
brew "python"
brew "ranger"
brew "rsync"
brew "rustup-init"
brew "sc-im"
brew "tmux"
brew "trash"
brew "tty-clock"
brew "unar"
brew "verilator"
brew "wget"
brew "youtube-dl"
brew "zero-sh/tap/apply-user-defaults"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "cliclick" # for automating mouse movements
brew "autopep8"
brew "flake8"
brew "pycodestyle" # required by autopep8
brew "pylint"
brew "jupyterlab"
brew "redshift", restart_service: true
brew "mupdf-tools" # non-pip dependency for termpdf.py
brew "gptfdisk" # crucial for quickly fixing apfs partition hexcode
brew "openssl" # required for generating crypt(3) passwords

cask "alacritty"
cask "bitwarden"
cask "brave-browser"
cask "coolterm"
cask "discord"
cask "elsorino/homebrew-elso/macfeh"
cask "eqmac"
cask "firefox"
cask "fliqlo"
cask "homebrew/cask-drivers/ftdi-vcp-driver"
cask "iina"
cask "keyboardcleantool"
cask "kitty"
cask "mactex-no-gui"
cask "minecraft"
cask "nordvpn"
cask "skim"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "ticktick"
cask "virtualbox" # required for docker
cask "visual-studio-code"
cask "xctu"
cask "xquartz"
cask "dmenu-mac"
cask "ubersicht"
cask "inkscape" # for latex drawings

mas "Dark Reader for Safari", id: 1438243180
